[
  {
    "id": "housemate_agreement",
    "title": "Housemate Agreement",
    "description": "A comprehensive agreement for living with housemates, covering rent, chores, guests, and more.",
    "sections": [
      {
        "id": "rent_bills",
        "title": "Rent & Bills",
        "terms": [
          "All housemates agree to split rent equally unless otherwise specified.",
          "Utility bills (electricity, water, internet, gas) will be divided equally.",
          "Rent and bills must be paid by the 1st of each month to the designated housemate/landlord.",
          "Late payments beyond 5 days will require informing all housemates.",
          "If a housemate moves out, they are responsible for their share until a replacement is found."
        ]
      },
      {
        "id": "chores",
        "title": "Chores & Cleaning",
        "terms": [
          "Each housemate will take turns cleaning shared spaces weekly (kitchen, bathroom, living room).",
          "Kitchen must be cleaned after cooking, including dishes and surfaces.",
          "Garbage duty rotates daily among housemates, with bins taken out on collection day.",
          "Neglected chores may be reassigned or resolved in a house meeting.",
          "Everyone agrees to keep personal items out of shared spaces."
        ]
      },
      {
        "id": "noise",
        "title": "Noise & Quiet Hours",
        "terms": [
          "Quiet hours are from 11 PM to 7 AM on weekdays and 1 AM to 9 AM on weekends.",
          "Music, parties, and loud gatherings require housemate approval in advance.",
          "Headphones must be used for late-night gaming, music, or calls.",
          "Housemates agree to respect sleep, study, and work schedules."
        ]
      },
      {
        "id": "guests",
        "title": "Guests & Visitors",
        "terms": [
          "Housemates must give at least 24 hours' notice before bringing overnight guests.",
          "Guests staying more than 3 nights in a week require group approval.",
          "Housemates are responsible for their guests’ behavior and damages.",
          "Guests may not use another housemate’s personal items without permission."
        ]
      },
      {
        "id": "supplies",
        "title": "Shared Supplies",
        "terms": [
          "Toilet paper, cleaning products, and other shared supplies will be bought jointly.",
          "Costs for supplies will be split equally among all housemates.",
          "If someone uses significantly more of a shared item, they agree to contribute extra.",
          "All purchases will be tracked in a shared expense app or log."
        ]
      },
      {
        "id": "food",
        "title": "Food & Kitchen Use",
        "terms": [
          "Each housemate’s food is their own unless explicitly shared.",
          "Shared cooking staples (oil, salt, spices) will be bought jointly.",
          "Fridge and cupboard space will be divided equally.",
          "Housemates agree not to take food that isn’t theirs without permission."
        ]
      },
      {
        "id": "disputes",
        "title": "Dispute Resolution",
        "terms": [
          "Disagreements will be discussed openly during house meetings.",
          "If unresolved, housemates agree to a majority vote.",
          "For ongoing conflicts, housemates may bring in an external mediator (friend, landlord, RA).",
          "Everyone commits to respectful communication and avoiding passive-aggressive behavior."
        ]
      }
    ]
  },
  {
    "id": "freelance_project",
    "title": "Freelance Project Agreement",
    "description": "A simple contract for freelancers and clients to outline deliverables, payment, and timelines.",
    "sections": [
      {
        "id": "scope",
        "title": "Scope of Work",
        "terms": [
          "The freelancer will deliver the agreed-upon services as described in the project brief.",
          "Any changes to the scope must be agreed upon in writing."
        ]
      },
      {
        "id": "payment",
        "title": "Payment Terms",
        "terms": [
          "Payment will be made upon completion of milestones or the entire project, as agreed.",
          "Late payments may incur a fee of 5% per week overdue."
        ]
      },
      {
        "id": "timeline",
        "title": "Timeline",
        "terms": [
          "The project will begin on the agreed start date and is expected to be completed by the agreed deadline.",
          "Delays must be communicated as soon as possible."
        ]
      },
      {
        "id": "confidentiality",
        "title": "Confidentiality",
        "terms": [
          "Both parties agree to keep all project information confidential."
        ]
      }
    ]
  },
  {
    "id": "group_project",
    "title": "Student Group Project Agreement",
    "description": "An agreement for students working together on a group project to clarify roles and expectations.",
    "sections": [
      {
        "id": "roles",
        "title": "Roles & Responsibilities",
        "terms": [
          "Each member will be assigned specific tasks and deadlines.",
          "All members agree to communicate regularly and attend group meetings."
        ]
      },
      {
        "id": "contributions",
        "title": "Contributions",
        "terms": [
          "All members are expected to contribute equally to the project.",
          "If a member is unable to contribute, they must inform the group in advance."
        ]
      },
      {
        "id": "conflict",
        "title": "Conflict Resolution",
        "terms": [
          "Disagreements will be resolved through group discussion.",
          "If unresolved, the issue will be brought to the instructor."
        ]
      }
    ]
  },
  {
    "id": "loaning_items",
    "title": "Loaning Personal Items Agreement",
    "description": "A simple agreement for lending and borrowing personal items between individuals.",
    "sections": [
      {
        "id": "item_details",
        "title": "Item Details",
        "terms": [
          "The lender agrees to loan the following item(s): [describe item(s) in detail].",
          "The borrower acknowledges receipt of the item(s) in good condition."
        ]
      },
      {
        "id": "loan_period",
        "title": "Loan Period",
        "terms": [
          "The loan period will begin on the agreed start date and end on the agreed return date.",
          "Extensions must be requested and approved by the lender."
        ]
      },
      {
        "id": "care_and_use",
        "title": "Care & Use",
        "terms": [
          "The borrower agrees to use the item(s) responsibly and only for their intended purpose.",
          "Any damage or loss must be reported to the lender immediately."
        ]
      },
      {
        "id": "return",
        "title": "Return of Item(s)",
        "terms": [
          "The borrower will return the item(s) in the same condition as received, except for normal wear and tear.",
          "If the item(s) are lost or damaged, the borrower agrees to repair or replace them as agreed with the lender."
        ]
      }
    ]
  }
]